In [ ]:
!pip install ipython-sql

In [1]:
%load_ext sql

In [2]:
%sql postgresql+psycopg2://postgres:superPassWork22@localhost:5555/SQLPuzzles

### Puzzle #1

In [8]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS Cart1;
DROP TABLE IF EXISTS Cart2;

CREATE TABLE Cart1
(
Item  VARCHAR(100) PRIMARY KEY
);

CREATE TABLE Cart2
(
Item  VARCHAR(100) PRIMARY KEY
);

INSERT INTO Cart1 (Item) VALUES
('Sugar'),('Bread'),('Juice'),('Soda'),('Flour');

INSERT INTO Cart2 (Item) VALUES
('Sugar'),('Bread'),('Butter'),('Cheese'),('Fruit');

[]

In [9]:
%%capture --no-display
%%sql

SELECT *
FROM Cart1
FULL OUTER JOIN Cart2 ON Cart1.item = Cart2.item

[('Sugar', 'Sugar'),
 ('Bread', 'Bread'),
 ('Juice', None),
 ('Soda', None),
 ('Flour', None),
 (None, 'Fruit'),
 (None, 'Butter'),
 (None, 'Cheese')]

### Puzzle #2

In [10]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS Employees;

CREATE TABLE Employees
(
EmployeeID  INTEGER PRIMARY KEY,
ManagerID   INTEGER NULL,
JobTitle    VARCHAR(100) NOT NULL
);

INSERT INTO Employees (EmployeeID, ManagerID, JobTitle) VALUES
(1001,NULL,'President'),(2002,1001,'Director'),
(3003,1001,'Office Manager'),(4004,2002,'Engineer'),
(5005,2002,'Engineer'),(6006,2002,'Engineer');

[]

### Puzzle 3

In [ ]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS EmployeePayRecords;

CREATE TABLE EmployeePayRecords
(
EmployeeID  INTEGER,
FiscalYear  INTEGER,
StartDate   DATE,
EndDate     DATE,
PayRate     MONEY
);

### Puzzle #4

In [11]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS Orders;

CREATE TABLE Orders
(
CustomerID     INTEGER,
OrderID        INTEGER,
DeliveryState  VARCHAR(100) NOT NULL,
Amount         MONEY NOT NULL,
PRIMARY KEY (CustomerID, OrderID)
);

INSERT INTO Orders (CustomerID, OrderID, DeliveryState, Amount) VALUES
(1001,1,'CA',340),(1001,2,'TX',950),(1001,3,'TX',670),
(1001,4,'TX',860),(2002,5,'WA',320),(3003,6,'CA',650),
(3003,7,'CA',830),(4004,8,'TX',120);

[]

In [18]:
%%capture --no-display
%%sql

SELECT *
FROM Orders
WHERE DeliveryState = 'TX'
LIMIT (
SELECT COUNT(customerid)
FROM Orders
WHERE DeliveryState = 'CA'
);

[(1001, 2, 'TX', '$950.00'),
 (1001, 3, 'TX', '$670.00'),
 (1001, 4, 'TX', '$860.00')]

### Puzzle #5

In [20]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS PhoneDirectory;

CREATE TABLE PhoneDirectory
(
CustomerID  INTEGER,
[Type]      VARCHAR(100),
PhoneNumber VARCHAR(12) NOT NULL,
PRIMARY KEY (CustomerID, [Type])
);

INSERT INTO PhoneDirectory (CustomerID, [Type], PhoneNumber) VALUES
(1001,'Cellular','555-897-5421'),
(1001,'Work','555-897-6542'),
(1001,'Home','555-698-9874'),
(2002,'Cellular','555-963-6544'),
(2002,'Work','555-812-9856'),
(3003,'Cellular','555-987-6541');

### Puzzle #6

In [4]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS WorkflowSteps;

CREATE TABLE WorkflowSteps
(
Workflow        VARCHAR(100),
StepNumber      INTEGER,
CompletionDate  DATE NULL,
PRIMARY KEY (Workflow, StepNumber)
);

INSERT INTO WorkflowSteps (Workflow, StepNumber, CompletionDate) VALUES
('Alpha',1,'7/2/2018'),('Alpha',2,'7/2/2018'),('Alpha',3,'7/1/2018'),
('Bravo',1,'6/25/2018'),('Bravo',2,NULL),('Bravo',3,'6/27/2018'),
('Charlie',1,NULL),('Charlie',2,'7/1/2018');

[]

In [7]:
%%capture --no-display
%%sql

SELECT *
FROM WorkflowSteps

[('Alpha', 1, datetime.date(2018, 7, 2)),
 ('Alpha', 2, datetime.date(2018, 7, 2)),
 ('Alpha', 3, datetime.date(2018, 7, 1)),
 ('Bravo', 1, datetime.date(2018, 6, 25)),
 ('Bravo', 2, None),
 ('Bravo', 3, datetime.date(2018, 6, 27)),
 ('Charlie', 1, None),
 ('Charlie', 2, datetime.date(2018, 7, 1))]

In [7]:
%%capture --no-display
%%sql

SELECT workflow, COUNT(stepnumber), COUNT(completiondate)
FROM WorkflowSteps
GROUP BY workflow
HAVING COUNT(stepnumber) != COUNT(completiondate)

[('Charlie', 2, 1), ('Bravo', 3, 2)]

### Puzzle #7

In [8]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS Candidates;
DROP TABLE IF EXISTS Requirements;

CREATE TABLE Candidates
(
CandidateID INTEGER,
Occupation  VARCHAR(100),
PRIMARY KEY (CandidateID, Occupation)
);

INSERT INTO Candidates (CandidateID, Occupation) VALUES
(1001,'Geologist'),(1001,'Astrogator'),(1001,'Biochemist'),
(1001,'Technician'),(2002,'Surgeon'),(2002,'Machinist'),
(3003,'Cryologist'),(4004,'Selenologist');

CREATE TABLE Requirements
(
Requirement VARCHAR(100) PRIMARY KEY
);

INSERT INTO Requirements VALUES
('Geologist'),('Astrogator'),('Technician');

[]

In [10]:
%%capture --no-display
%%sql

SELECT *
FROM Candidates

[(1001, 'Geologist'),
 (1001, 'Astrogator'),
 (1001, 'Biochemist'),
 (1001, 'Technician'),
 (2002, 'Surgeon'),
 (2002, 'Machinist'),
 (3003, 'Cryologist'),
 (4004, 'Selenologist')]

In [12]:
%%capture --no-display
%%sql

SELECT CandidateID, COUNT(Occupation)
FROM Candidates
WHERE occupation = 'Geologist' OR occupation = 'Astrogator' OR occupation = 'Technician'
GROUP BY CandidateID
HAVING COUNT(Occupation) = 3

[(1001, 3)]

### Puzzle #8

In [13]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS WorkflowCases;

CREATE TABLE WorkflowCases
(
Workflow  VARCHAR(100) PRIMARY KEY,
Case1     INTEGER NOT NULL DEFAULT 0,
Case2     INTEGER NOT NULL DEFAULT 0,
Case3     INTEGER NOT NULL DEFAULT 0
);

INSERT INTO WorkflowCases (Workflow, Case1, Case2, Case3) VALUES
('Alpha',0,0,0),('Bravo',0,1,1),('Charlie',1,0,0),('Delta',0,0,0);

[]

In [15]:
%%capture --no-display
%%sql

SELECT workflow, (case1 + case2 + case3) AS Sum
FROM WorkflowCases

[('Alpha', 0), ('Bravo', 2), ('Charlie', 1), ('Delta', 0)]

### Puzzle #9

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql

### Puzzle #10

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql

### Puzzle #11

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql

### Puzzle #12

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql

### Puzzle #13

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql

### Puzzle #14

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql

### Puzzle #15

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql

### Puzzle #16

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql

### Puzzle #17

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql

### Puzzle #18

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql

### Puzzle #19

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql

### Puzzle #20

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql